import { useEffect } from 'react';

const useConsoleLogProduction = () => {
  useEffect(() => {
    const log = console['log'];
    if (import.meta.env.MODE === 'production') {
      queueMicrotask(() => {
        log(
          `%c
██╗     ██╗   ██╗███╗   ███╗ ██████╗ 
██║     ██║   ██║████╗ ████║██╔═══██╗
██║     ██║   ██║██╔████╔██║██║   ██║
██║     ██║   ██║██║╚██╔╝██║██║   ██║
███████╗╚██████╔╝██║ ╚═╝ ██║╚██████╔╝
╚══════╝ ╚═════╝ ╚═╝     ╚═╝ ╚═════╝ 

%cLUMO 🚀
https://your-domain.com
          `,
          'font-family: monospace; font-size: 12px; color:#ff461e;',
          'font-size: 14px; font-weight: bold; color: #ffffff;',
        );
      });
    }
  }, []);
};

export default useConsoleLogProduction;
